In [43]:
from socceraction.data.wyscout import PublicWyscoutLoader
from socceraction.spadl.wyscout import convert_to_actions

In [44]:
api = PublicWyscoutLoader(root="data/wyscout")

In [45]:
# Competitions Input
competitions_df = api.competitions()
competitions_df.head()

,competition_id,season_id,country_name,competition_name,competition_gender,season_name
0,524,181248,Italy,Italian first division,male,2017/2018
1,364,181150,England,English first division,male,2017/2018
2,795,181144,Spain,Spanish first division,male,2017/2018
3,412,181189,France,French first division,male,2017/2018
4,426,181137,Germany,German first division,male,2017/2018

In [46]:
# Games Input (Competition_id, Season_id)
games_england_df = api.games(364, 181150)
games_england_df.tail()

,game_id,competition_id,season_id,game_date,game_day,home_team_id,away_team_id
375,2499723,364,181150,2017-08-12 14:00:00,1,1623,1639
376,2499726,364,181150,2017-08-12 14:00:00,1,1619,10531
377,2499728,364,181150,2017-08-12 14:00:00,1,1627,1659
378,2499727,364,181150,2017-08-12 11:30:00,1,1644,1612
379,2499719,364,181150,2017-08-11 18:45:00,1,1609,1631

In [47]:
# Teams Input (game_id)
teams_england_df = api.teams(2499726)
teams_england_df.head()

   team_id team_name_short         team_name
0    10531    Swansea City  Swansea City AFC
1     1619     Southampton    Southampton FC

In [48]:
# Events Input (game_id)
event_england_df = api.events(2499726)
event_england_df.head()

print(event_england_df.subtype_name.unique())

['Simple pass' 'Ground defending duel' 'Ground attacking duel'
 'Ball out of the field' 'Throw in' 'Cross' 'Clearance' 'Corner'
 'Ground loose ball duel' 'Shot' 'Goal kick' 'Air duel'
 'Goalkeeper leaving line' 'High pass' 'Head pass' 'Touch' 'Launch'
 'Smart pass' 'Foul' 'Free Kick' 'Free kick cross' 'Hand foul'
 'Save attempt' 'Acceleration' '' 'Hand pass' 'Free kick shot']

In [49]:
# Convert Wyscout to SPADL Format 
spadl_events_england_df = convert_to_actions(event_england_df, 1619)
spadl_events_england_df.head()

,game_id,period_id,time_seconds,team_id,player_id,start_x,start_y,end_x,end_y,original_event_id,bodypart_id,type_id,result_id,action_id
0,2499726,1,0.506969,10531,77557,53.55,34.68,73.5,33.32,178218751,0,0,1,0
1,2499726,1,2.281237,10531,77550,73.50,33.32,73.5,19.04,178218752,0,0,1,1
2,2499726,1,4.066574,10531,246866,73.50,19.04,79.8,48.28,178218753,0,0,1,2
3,2499726,1,6.515098,10531,21164,79.80,48.28,71.4,65.28,178218754,0,0,1,3
4,2499726,1,8.587495,10531,8336,71.40,65.28,65.1,50.32,178218755,0,0,0,4